stm32-hotspot/STM32H563-OEMiRoT-SingleSlot/Drivers/BSP/STM32H5F5J-DK/stm32h5f5j_discovery_xspi.c
  /* Check if the instance is supported */
  if (Instance >= XSPI_RAM_INSTANCES_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    if (APS6408_Read(&hxspi_ram[Instance], pData, ReadAddr, Size,
                     (uint32_t)APS6408_READ_REG_LATENCY(APS6408_READ_LATENCY_5),
                     (uint32_t)BSP_XSPI_RAM_LINEAR_BURST) != APS6408_OK)
    {
      ret = BSP_ERROR_PERIPH_FAILURE;
    }
  }

  /* Return BSP status */
  return ret;
}

/**
  * @brief  Reads an amount of data from the 16-bits Octal RAM memory in DMA mode.
  * @param  Instance  XSPI instance
  * @param  pData     Pointer to data to be read
  * @param  ReadAddr  Read start address
  * @param  Size      Size of data to read
  * @retval BSP status
  */
int32_t BSP_XSPI_RAM_Read_DMA(uint32_t Instance, uint8_t *pData, uint32_t ReadAddr, uint32_t Size)
{
  int32_t ret = BSP_ERROR_NONE;

  /* Check if the instance is supported */
  if (Instance >= XSPI_RAM_INSTANCES_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    if (APS6408_Read_DMA(&hxspi_ram[Instance], pData, ReadAddr, Size,
                         (uint32_t)APS6408_READ_REG_LATENCY(APS6408_READ_LATENCY_5),
                         (uint32_t)BSP_XSPI_RAM_LINEAR_BURST) != APS6408_OK)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
  }

  /* Return BSP status */
  return ret;
}

/**
  * @brief  Writes an amount of data to the XSPI memory.
  * @param  Instance  XSPI instance
  * @param  pData     Pointer to data to be written
  * @param  WriteAddr Write start address
  * @param  Size      Size of data to write
  * @retval BSP status
  */
int32_t BSP_XSPI_RAM_Write(uint32_t Instance, uint8_t *pData, uint32_t WriteAddr, uint32_t Size)
{
  int32_t ret = BSP_ERROR_NONE;

  /* Check if the instance is supported */
  if (Instance >= XSPI_RAM_INSTANCES_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    if (APS6408_Write(&hxspi_ram[Instance], pData, WriteAddr, Size,
                      (uint32_t)APS6408_WRITE_LATENCY(APS6408_WRITE_LATENCY_5),
                      (uint32_t)BSP_XSPI_RAM_LINEAR_BURST) != APS6408_OK)
    {
      ret = BSP_ERROR_PERIPH_FAILURE;
    }
  }

  /* Return BSP status */
  return ret;
}

/**
  * @brief  Writes an amount of data to the 16-bits Octal RAM memory in DMA mode.
  * @param  Instance  XSPI instance
  * @param  pData     Pointer to data to be written
  * @param  WriteAddr Write start address
  * @param  Size      Size of data to write
  * @retval BSP status
  */
int32_t BSP_XSPI_RAM_Write_DMA(uint32_t Instance, uint8_t *pData, uint32_t WriteAddr, uint32_t Size)
{
  int32_t ret = BSP_ERROR_NONE;

  /* Check if the instance is supported */
  if (Instance >= XSPI_RAM_INSTANCES_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    if (APS6408_Write_DMA(&hxspi_ram[Instance], pData, WriteAddr, Size,
                          (uint32_t)APS6408_WRITE_LATENCY(APS6408_WRITE_LATENCY_5),
                          (uint32_t)BSP_XSPI_RAM_LINEAR_BURST) != APS6408_OK)
    {
      ret = BSP_ERROR_COMPONENT_FAILURE;
    }
  }

  /* Return BSP status */
  return ret;
}

/**
  * @brief  Configure the XSPI in memory-mapped mode
  * @param  Instance  XSPI instance
  * @retval BSP status
  */
int32_t BSP_XSPI_RAM_EnableMemoryMappedMode(uint32_t Instance)
{
  int32_t ret = BSP_ERROR_NONE;

  /* Check if the instance is supported */
  if (Instance >= XSPI_RAM_INSTANCES_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    if (APS6408_EnableMemoryMappedMode(&hxspi_ram[Instance],
                                        (uint32_t)APS6408_READ_REG_LATENCY(APS6408_READ_LATENCY_5),
                                        (uint32_t)APS6408_WRITE_LATENCY(APS6408_WRITE_LATENCY_5),
                                        (uint32_t)BSP_XSPI_RAM_LINEAR_BURST) != APS6408_OK)
    {
      ret = BSP_ERROR_PERIPH_FAILURE;
    }
    else /* Update XSPI context if all operations are well done */
    {
      XSPI_Ram_Ctx[Instance].IsInitialized = XSPI_ACCESS_MMP;
    }
  }

  /* Return BSP status */
  return ret;
}

/**
  * @brief  Exit the memory-mapped mode
  * @param  Instance  XSPI instance
  * @retval BSP status
  */
int32_t BSP_XSPI_RAM_DisableMemoryMappedMode(uint32_t Instance)
{
  int32_t ret = BSP_ERROR_NONE;

  /* Check if the instance is supported */
  if (Instance >= XSPI_RAM_INSTANCES_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else
  {
    if (XSPI_Ram_Ctx[Instance].IsInitialized != XSPI_ACCESS_MMP)
    {
      ret = BSP_ERROR_XSPI_MMP_UNLOCK_FAILURE;
    }
    /* Abort MMP back to indirect mode */
    else if (HAL_XSPI_Abort(&hxspi_ram[Instance]) != HAL_OK)
    {
      ret = BSP_ERROR_PERIPH_FAILURE;
    }
    /* Update XSPI HyperRAM context if all operations are well done */
    else
    {
      XSPI_Ram_Ctx[Instance].IsInitialized = XSPI_ACCESS_INDIRECT;
    }
  }

  /* Return BSP status */
  return ret;
}

/**
  * @brief  Get RAM ID 3 Bytes:
  *         Vendor ID, Device ID, Device Density
  * @param  Instance  XSPI instance
  * @param  Id Pointer to RAM ID bytes
  * @retval BSP status
  */
int32_t BSP_XSPI_RAM_ReadID(uint32_t Instance, uint8_t *Id)
{
  int32_t ret;

  /* Check if the instance is supported */
  if (Instance >= XSPI_RAM_INSTANCES_NUMBER)
  {
    ret = BSP_ERROR_WRONG_PARAM;
  }
  else if (APS6408_ReadID(&hxspi_ram[0], Id, (uint32_t)APS6408_READ_REG_LATENCY(APS6408_READ_LATENCY_5)) != APS6408_OK)
  {
    ret = BSP_ERROR_COMPONENT_FAILURE;
  }
  else
  {
    ret = BSP_ERROR_NONE;
  }

  /* Return BSP status */
  return ret;
}

/**
  * @brief  Handles XSPI 16-bits Octal RAM DMA transfer interrupt request.
  * @param  Instance XSPI instance
  * @retval None
  */
void BSP_XSPI_RAM_DMA_RX_IRQHandler(uint32_t Instance)
{
  HAL_DMA_IRQHandler(hxspi_ram[Instance].hdmarx);
}

/**
  * @brief  Handles XSPI 16-bits Octal RAM DMA transfer interrupt request.
  * @param  Instance XSPI instance
  * @retval None
  */
void BSP_XSPI_RAM_DMA_TX_IRQHandler(uint32_t Instance)
{
  HAL_DMA_IRQHandler(hxspi_ram[Instance].hdmatx);
}

/**
  * @brief  Handles XSPI 16-bits Octal RAM interrupt request.
  * @param  Instance XSPI instance
  * @retval None
  */
void BSP_XSPI_RAM_IRQHandler(uint32_t Instance)
{
  HAL_XSPI_IRQHandler(&hxspi_ram[Instance]);
}
/**
  * @}
  */
#endif /* USE_RAM_MEMORY_APS6408 */

#if (USE_NOR_MEMORY_MX25LM51245G == 1)
/** @addtogroup STM32H5F5J_DK_XSPI_NOR_Private_Functions
  * @{
  */

/**
  * @brief  Initializes the XSPI MSP.
  * @param  hxspi XSPI handle
  * @retval None
  */
static void XSPI_NOR_MspInit(XSPI_HandleTypeDef *hxspi)
{
  GPIO_InitTypeDef GPIO_InitStruct;

  /* hxspi unused argument(s) compilation warning */
  UNUSED(hxspi);

  /* Enable the SBS Clock */
  __HAL_RCC_SBS_CLK_ENABLE();

